test/0/p
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      pAir;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    inlet
    {
        type            zeroGradient;
    }

    outlet
    {
        type		fixedValue;
        value        	uniform 0;
    }

    leftUpWall
    {
        type            zeroGradient;
    }

    rightUpWall
    {
        type            zeroGradient;
    }

    anode
    {
        type            zeroGradient;
    }
    
    cathode
    {
        type            zeroGradient;
    }    

    frontAndBack
    {
        type            empty;
    }
}

// ************************************************************************* //
