test/0/rho
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      ni;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 -3 1 0 0 1 0];

internalField   uniform 1e-10;

boundaryField
{
    inlet
    {
        type            zeroGradient;
    }

    outlet
    {
        type            zeroGradient;
    }

    leftUpWall
    {
        type            zeroGradient;
    }

    rightUpWall
    {
        type            zeroGradient;
    }

    anode
    {
        type		fixedValue;
        value        	uniform	12.32;
    }
    
    cathode
    {
        type            zeroGradient;
    }    

    frontAndBack
    {
        type            empty;
    }
}

// ************************************************************************* //
