test/constant/physicalProperties
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      physicalProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

epsilon0 epsilon0 [-1 -3 4 0 0 2 0] 8.854e-12;
k      k [-1 0 2 0 0 1 0] 1.33e-4;
rho0    rho0 [1 -3 0 0 0 0 0] 1.205;
nu      nu [0 2 -1 0 0 0 0] 1.51e-5;
T      T [0 0 0 1 0 0 0] 300.0;

// ************************************************************************* //
